tugas-eas/logs/sysbench_run_1pd.log
Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 8877.24 qps: 8877.24 (r/w/o: 8877.24/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 9388.45 qps: 9388.45 (r/w/o: 9388.45/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 9606.99 qps: 9606.99 (r/w/o: 9606.99/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 9759.57 qps: 9759.57 (r/w/o: 9759.57/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 9699.30 qps: 9699.30 (r/w/o: 9699.30/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 9731.53 qps: 9731.53 (r/w/o: 9731.53/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 9879.52 qps: 9879.52 (r/w/o: 9879.52/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 9503.98 qps: 9503.98 (r/w/o: 9503.98/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 9611.45 qps: 9611.45 (r/w/o: 9611.45/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 9696.03 qps: 9696.03 (r/w/o: 9696.03/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 9265.56 qps: 9265.56 (r/w/o: 9265.56/0.00/0.00) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 9769.74 qps: 9769.74 (r/w/o: 9769.74/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 16 tps: 9519.19 qps: 9519.19 (r/w/o: 9519.19/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 16 tps: 9585.00 qps: 9585.00 (r/w/o: 9585.00/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 16 tps: 9674.66 qps: 9674.66 (r/w/o: 9674.66/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 16 tps: 9637.31 qps: 9637.31 (r/w/o: 9637.31/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 16 tps: 9768.76 qps: 9768.76 (r/w/o: 9768.76/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 16 tps: 10134.01 qps: 10134.01 (r/w/o: 10134.01/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 16 tps: 9490.60 qps: 9490.60 (r/w/o: 9490.60/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 16 tps: 9465.84 qps: 9465.84 (r/w/o: 9465.84/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 16 tps: 9331.74 qps: 9331.74 (r/w/o: 9331.74/0.00/0.00) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 16 tps: 9619.85 qps: 9619.85 (r/w/o: 9619.85/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 16 tps: 9291.72 qps: 9291.72 (r/w/o: 9291.72/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 16 tps: 9437.24 qps: 9437.24 (r/w/o: 9437.24/0.00/0.00) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 16 tps: 9238.97 qps: 9238.97 (r/w/o: 9238.97/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 16 tps: 9499.52 qps: 9499.52 (r/w/o: 9499.52/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 16 tps: 9589.21 qps: 9589.21 (r/w/o: 9589.21/0.00/0.00) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 16 tps: 9411.86 qps: 9411.86 (r/w/o: 9411.86/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 16 tps: 9396.74 qps: 9396.74 (r/w/o: 9396.74/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 16 tps: 9530.02 qps: 9530.02 (r/w/o: 9530.02/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2864153
        write:                           0
        other:                           0
        total:                           2864153
    transactions:                        2864153 (9546.97 per sec.)
    queries:                             2864153 (9546.97 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0051s
    total number of events:              2864153

Latency (ms):
         min:                                    0.23
         avg:                                    1.67
         max:                                   27.01
         95th percentile:                        2.81
         sum:                              4796853.61

Threads fairness:
    events (avg/stddev):           179009.5625/205.49
    execution time (avg/stddev):   299.8034/0.01