tugas-eas/logs/sysbench_run_3pd.log
Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 7596.84 qps: 7596.84 (r/w/o: 7596.84/0.00/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 8666.09 qps: 8666.09 (r/w/o: 8666.09/0.00/0.00) lat (ms,95%): 3.13 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 8266.19 qps: 8266.19 (r/w/o: 8266.19/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 8124.22 qps: 8124.22 (r/w/o: 8124.22/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 7623.14 qps: 7623.14 (r/w/o: 7623.14/0.00/0.00) lat (ms,95%): 4.33 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 7578.34 qps: 7578.34 (r/w/o: 7578.34/0.00/0.00) lat (ms,95%): 5.00 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 8562.69 qps: 8562.69 (r/w/o: 8562.69/0.00/0.00) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 8692.00 qps: 8692.00 (r/w/o: 8692.00/0.00/0.00) lat (ms,95%): 3.13 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 7051.08 qps: 7051.08 (r/w/o: 7051.08/0.00/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 8934.47 qps: 8934.47 (r/w/o: 8934.47/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 8780.92 qps: 8780.92 (r/w/o: 8780.92/0.00/0.00) lat (ms,95%): 3.02 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 8682.11 qps: 8682.11 (r/w/o: 8682.11/0.00/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 16 tps: 9019.43 qps: 9019.43 (r/w/o: 9019.43/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 16 tps: 8996.10 qps: 8996.10 (r/w/o: 8996.10/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 16 tps: 6732.83 qps: 6732.83 (r/w/o: 6732.83/0.00/0.00) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 16 tps: 8880.46 qps: 8880.46 (r/w/o: 8880.46/0.00/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 16 tps: 8861.22 qps: 8861.22 (r/w/o: 8861.22/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 16 tps: 8906.52 qps: 8906.52 (r/w/o: 8906.52/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 16 tps: 8878.91 qps: 8878.91 (r/w/o: 8878.91/0.00/0.00) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 16 tps: 8963.33 qps: 8963.33 (r/w/o: 8963.33/0.00/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 16 tps: 8751.58 qps: 8751.58 (r/w/o: 8751.58/0.00/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 16 tps: 9075.94 qps: 9075.94 (r/w/o: 9075.94/0.00/0.00) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 16 tps: 8896.52 qps: 8896.52 (r/w/o: 8896.52/0.00/0.00) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 16 tps: 9002.70 qps: 9002.70 (r/w/o: 9002.70/0.00/0.00) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 16 tps: 8972.67 qps: 8972.67 (r/w/o: 8972.67/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 16 tps: 9062.66 qps: 9062.66 (r/w/o: 9062.66/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 16 tps: 8405.94 qps: 8406.04 (r/w/o: 8406.04/0.00/0.00) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 16 tps: 8959.87 qps: 8959.77 (r/w/o: 8959.77/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 16 tps: 8842.18 qps: 8842.18 (r/w/o: 8842.18/0.00/0.00) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 16 tps: 8987.32 qps: 8987.32 (r/w/o: 8987.32/0.00/0.00) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2567577
        write:                           0
        other:                           0
        total:                           2567577
    transactions:                        2567577 (8558.44 per sec.)
    queries:                             2567577 (8558.44 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0041s
    total number of events:              2567577

Latency (ms):
         min:                                    0.27
         avg:                                    1.87
         max:                                   56.57
         95th percentile:                        3.19
         sum:                              4797173.03

Threads fairness:
    events (avg/stddev):           160473.5625/212.43
    execution time (avg/stddev):   299.8233/0.00